#ifndef _DEFINES_H
#define _DEFINES_H
//--------------------------------------------------------------------------------
#define ORGNAME "КБ'Селена' г.Краснодар"
#define APPNAME "ParPort"
#define APPVERS "версия 1.0"
//--------------------------------------------------------------------------------
//#define FAKE_DATADIR
//#define FLAG_RESIZE
//--------------------------------------------------------------------------------
#define ICON_PROGRAMM   ":/mainwindow/computer.png"
//--------------------------------------------------------------------------------
#endif
