#ifndef DEFINES_HPP
#define DEFINES_HPP
//--------------------------------------------------------------------------------
#define ORGNAME "ООО \"РИП-Импульс\""
#define APPNAME "Тест источника напряжения постоянного тока"
//--------------------------------------------------------------------------------
#define POWER_SUPPLY_NAME_B588 "источник напряжения постоянного тока Б5-88"
#define POWER_SUPPLY_NAME_B590 "источник напряжения постоянного тока Б5-90"
//--------------------------------------------------------------------------------
#define V786_2_NAME "мультиметр В7-64/2"
//--------------------------------------------------------------------------------
#define ICON_PROGRAMM   ":/mainwindow/computer.png"
//--------------------------------------------------------------------------------
#define MAX_TIMEOUT_MULTIMETER_CALIBRATION  10000
#define MAX_TIMEOUT_MULTIMETER_CONTROL_UI   10000
#define MAX_TIMEOUT_MULTIMETER_CONTROL_RLC  20000

#define LIMIT_AUTO  8
//--------------------------------------------------------------------------------
#define TIME_READY_POWERSUPPLY_MS 3000
#define DEFAULT_U 3000
#define DEFAULT_I 2500
//--------------------------------------------------------------------------------
enum {
  NO_TASK = 0,                  // Пусто (нет задачи)
  TASK_CALIBRATION_ADC_U = 1,   // Запуск калибровки АЦП по напряжению
  TASK_CALIBRATION_ADC_I = 2,   // Запуск калибровки АЦП по току
  TASK_CALIBRATION_DAC_U = 3,   // Запуск калибровки ЦАП по напряжению
  TASK_CALIBRATION_DAC_I = 4,   // Запуск калибровки ЦАП по току
  TASK_SLP = 5,                 // Режим SLP
  TASK_SHOW_ERROR = 6,          // Отображение ошибки - выход вниз (запомнить до тех пор пока не окажемся внизу (там отображение)
  TASK_RETURN_MENU = 7          // Выход в основное меню (или меню настроек, если неверны калибровки)
};
//--------------------------------------------------------------------------------
#endif
