#ifndef DEFINES_HPP
#define DEFINES_HPP
//--------------------------------------------------------------------------------
//#define htons(n) (unsigned short)((((unsigned short) (n)) << 8) | (((unsigned short) (n)) >> 8))
//#define htonl(n) (unsigned int)((((unsigned int) (n)) << 16) | (((unsigned int) (n)) >> 16))
//--------------------------------------------------------------------------------
#define ORGNAME "Work"
#define APPNAME "ADC_powersupply"
//--------------------------------------------------------------------------------
#define POWER_SUPPLY_NAME_B590 "Источник напряжения постоянного тока Б5-90"
#define POWER_SUPPLY_NAME_B588 "Источник напряжения постоянного тока Б5-88"
//--------------------------------------------------------------------------------
#define TIME_READY_POWERSUPPLY_MS 3000
#define DEFAULT_U   3000
#define DEFAULT_I   2500
//--------------------------------------------------------------------------------
#define FULL_ADC    16777216
#define ZERO_ADC    8388608
//--------------------------------------------------------------------------------
enum {
  NO_TASK = 0,                  // Пусто (нет задачи)
  TASK_CALIBRATION_ADC_U = 1,   // Запуск калибровки АЦП по напряжению
  TASK_CALIBRATION_ADC_I = 2,   // Запуск калибровки АЦП по току
  TASK_CALIBRATION_DAC_U = 3,   // Запуск калибровки ЦАП по напряжению
  TASK_CALIBRATION_DAC_I = 4,   // Запуск калибровки ЦАП по току
  TASK_SLP = 5,                 // Режим SLP
  TASK_SHOW_ERROR = 6,          // Отображение ошибки - выход вниз (запомнить до тех пор пока не окажемся внизу (там отображение)
  TASK_RETURN_MENU = 7          // Выход в основное меню (или меню настроек, если неверны калибровки)
};
//--------------------------------------------------------------------------------
#define PAGE_SIZE   256
//--------------------------------------------------------------------------------
#define ICON_PROGRAMM   ":/mainwindow/computer.png"
//--------------------------------------------------------------------------------
#endif
