//***************************************************************************
//
//  File........: bcd.h
//
//  Author(s)...: Pashgan ChipEnable.Ru
//
//  Target(s)...: для любого микроконтроллера
//
//  Compiler....: подходит для любоко компилятора 
//
//  Description.: библиотека для перевода двоичных чисел в символы и вывода их на жкд 
//
//  Revisions...: 
//
//  18.10.2009 - 1.0 - Создан                                       - Pashgan.
//
//***************************************************************************
#ifndef BCD_H
#define BCD_H

//здесь подключаем свою либу для жкд
#include "lcd_lib_2.h"

//здесь переопределяем функцию по выводу символа на экран
#define LcdSendData(data) LCD_WriteData(data)

//если закомментировать, то ноль в старших разрядах выводиться не будет 
#define MIRROR_NULL_


/**************************************************************************
*   Function name :   BCD_1Lcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 9    
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void BCD_1Lcd(unsigned char value);

/**************************************************************************
*   Function name :   BCD_2Lcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 99   
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void BCD_2Lcd(unsigned char value);

/**************************************************************************
*   Function name :   BCD_3Lcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 255    
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void BCD_3Lcd(unsigned char value);

/**************************************************************************
*   Function name :   BCD_3IntLcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 999    
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void BCD_3IntLcd(unsigned int value);

/**************************************************************************
*   Function name :   BCD_4IntLcd
*   Returns :         нет       
*   Parameters :      значение числа от 0 до 9999    
*   Purpose :         переводит число в символ и выводит на жкд        
****************************************************************************/
void BCD_4IntLcd(unsigned int value);

#endif //BCD_H

